import React from "react";
import {Ifilm}  from '../models';
import ThorImage from '../img/thor.webp';
import TorontoImage from '../img/man_from_toronto.webp';
import Dino from '../img/Dino.webp';

export const film: Ifilm[]=[
    {
        id:1,
        filmName:'THOR',
        year: '2022',
        country:'CША',
        janr:' Приключения / Фильмы /',
        rejuser:'Тайка Вайтити',
        actors:'Крис ХемсвортНатали ПортманКристиан БэйлТесса ТомпсонТайка ВайтитиРассел КроуДжейми АлександерКрис ПраттДэйв БатистаКарен Гиллан',
        duration:'1:29',
        description:'После трагичных событий Тор потерял не только трон, положение и родных, он утерял самое главное – себя. До каких-то пор он жил падшей жизнью, сильно увлекался алкоголем и вел не здоровое существование. Но решил исправить ситуацию. Он путешествовал со стражами галактиками, они стали хорошей компанией для приключений. Во время поездок он искал себя, пытался найти новое место в мире. Он его планы...',
        allDescription:'После трагичных событий Тор потерял не только трон, положение и родных, он утерял самое главное – себя. До каких-то пор он жил падшей жизнью, сильно увлекался алкоголем и вел не здоровое существование. Но решил исправить ситуацию. Он путешествовал со стражами галактиками, они стали хорошей компанией для приключений. Во время поездок он искал себя, пытался найти новое место в мире. Он его планы меняются, когда ему выпадает встретиться с Горром, которого называют Убийца Богов. Параллельно развивается жизнь Джейн Фостер. Она бывшая девушка героя, увлекающаяся астрофизикой. Она очень сильно больна, простой человек не способен справиться со столь ужасным недугом. Но происходит чудо, она находит связь с Мьёльниром. Осколки оружия превращает ее в Могучего Тора, и у нее появляются суперспособности. Она быстро научилась уживаться со своей новой сущностью и частично привыкла к ответственности. На кого остался Асгард? Царством управляет Валькирия, она умело справляется со всеми обязанностями. Столкнувшись с серьезным врагом, Тор собирает команду из друзей и бывшей любви, чтобы сразиться с чудовищем. Враг желает уничтожить всех богов, он жесток и злобен. Команда формируется из Дженй, Коргома, Валькирии и некогда великого принца Асгарда.',
        image:ThorImage
        
    },
    {
        id:2,
        filmName:'Человек из Торонто',
        year: '2022',
        country:'CША',
        janr:' Приключения / Фильмы /',
        rejuser:'Патрик Хьюз',
        actors:' Кевин ХартВуди ХаррельсонJasmine MathewsКейли КуокоПирсон ФодЭллен БаркинЖанкарлос КанелаРонни РоуАлехандро Де ХойосЛила Лорен',
        duration:'110 мин',
        description:'В центре рассказа - парень Тедди, которого можно считать полным неудачником. Он работает продавцом-консультантом, который уже долгое время ели успевает отбиваться от постоянных проблем в своей жизни. Он мечтает быстрее отдохнуть от всего этого. И вдруг ему выпадает возможность отправиться в долгожданный отпуск, на который он возлагает большие надежды. Но и тут все идет не по плану. Очень часто на...',
        allDescription:'В центре рассказа - парень Тедди, которого можно считать полным неудачником. Он работает продавцом-консультантом, который уже долгое время ели успевает отбиваться от постоянных проблем в своей жизни. Он мечтает быстрее отдохнуть от всего этого. И вдруг ему выпадает возможность отправиться в долгожданный отпуск, на который он возлагает большие надежды. Но и тут все идет не по плану. Очень часто на онлайн-сервисах поиска квартир у клиентов совпадают требование. Так случилось и с Тедди: он по ошибке попадает в квартиру опасного убийцы. Его сразу приняли за преступника, и он, чтобы избежать следующих трудностей, решает продолжать прикидываться им. Тедди думает, что на этом история закончилась и он сможет наконец-то нормально отдохнуть. Но неожиданно в квартиру врываются агенты полиции и совершают задержание невиновного Тедди. В отделении он пытается объяснить оперативникам, что произошла ошибка и никакого отношения к настоящему убийце он не имеет. Теперь у полицейских появилась прекрасная идея, как им выйти на преступника, все еще разгуливающего на свободе. И в этом им поможет несчастный Тедди. Они должны успеть это сделать до того момента, пока он еще кого-то не убил.',
        image:TorontoImage
        
    },
    {
        id:3,
        filmName:'Мир Юрского периода: Господство',
        year: '2022',
        country:'CША',
        janr:' Приключения / Фильмы /',
        rejuser:'Колин Треворроу',
        actors:'Крис ПраттБрайс Даллас ХовардЛора ДернСэм НилДжефф ГолдблюмДеВанда УайзМамуду АтиИзабелла СермонКэмпбелл СкоттБ.Д. Вонг',
        duration:'147мин',
        description:'Продолжение второй нашумевшей трилогии Парка Юроского Периода и ее завершающий финал. В третьей части, по прошествии четырех лет, выпущенные на свободу динозавры сумели выжить после уничтожения острова Нубилар И не только выжить, но и размножиться и заполонить всю планету. Перед началом фильма зрителям предоставляется пролог, где создатели фильма напомнят краткую историю, появления динозавров',
        allDescription:'Продолжение второй нашумевшей трилогии Парка Юроского Периода и ее завершающий финал. В третьей части, по прошествии четырех лет, выпущенные на свободу динозавры сумели выжить после уничтожения острова Нубилар И не только выжить, но и размножиться и заполонить всю планету. Перед началом фильма зрителям предоставляется пролог, где создатели фильма напомнят краткую историю, появления динозавров. С доисторических времен, когда человечество еще не было в задумках. Зрителя порадуют, новыми видами динозавров, которые еще не успели появиться в ранее продемонстрированных частях. Люди научились сосуществовать с этими первобытными рептилиями, вместе охотиться, жить и использовать их, как помощников в быту. Но мирное сосуществование это такая тонкая грань, когда два вида совершенных хищников, должны утвердиться и занять лидирующее место в экосистеме. Сможет ли человек преодолеть тот серьезный барьер, чтобы сохранить свой вид, или динозавры навсегда покончат с человеческим родом? Герои фильма покажут всю свою самоотверженность в борьбе с этими хищниками, чтобы выжить и дать своим потомкам жить полной жизнью, без угрозы быть уничтоженными динозаврами.',
        image:Dino
        
    },

]